app/Controllers/CourseController.php

SELECT *
FROM `courses`
---
    public function showCourses()
    {
        // get all student data
        $data['courses'] = $this->courseModel->findAll();

SELECT *
FROM `courses`
WHERE `courses`.`id` = 1
---
    public function edit($id): string
    {
        $data['course'] = $this->courseModel->find((int) $id);

UPDATE `courses` SET `credits` = '4', `semester` = '2'
WHERE `courses`.`id` IN ('1')
---
    public function update($id)
    {
        // get data from form
        $data = $this->request->getPost();

        // validate if no update occurs
        if (empty($data)) {
            return redirect()->back()->with('error', 'No data provided for update');
        }

        // find course data to update
        $course = $this->courseModel->find($id);
        // update course data with data from form
        $course->fill($data);

        // update course data at table and success
        if ($this->courseModel->save($course)) {